---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.Clear
source: html/73e50d33-1d8c-7181-8220-404a077b4dec.htm
---
# Autodesk.Revit.DB.PlanTopologySet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```